SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = off;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET escape_string_warning = off;
SET row_security = off;


INSERT INTO task.template_task
(id, type_link,  department_link, name, parent_link, job_title_signed_link) VALUES
(1, 1,  7, 'Работы по изделию 9А317Э', null, 2),
    (2, 4, 22,  'Поступление изделия 9А317Э в ремонт', 1, 2), -- Наряд, накладная, акт состояния и акт приёма-передачи
    (3, 5, 2, 'УЧЁТ изделия 9А317Э', 1 , 2), -- Журнал приёма и учета
    (4, 5, 3, 'Приём изделия 9А317Э', 1 , 2), -- Журнал, акт приёма изделия
    (5, 6, 4, 'Очистка и мойка изделия 9А317Э', 1, 2), -- ПЗ, Руководство по ремонту
    (6, 5, 5, 'Прием изделия 9А317Э в ремонт', 1, 2), -- Акт приёма изделия в ремонт
    (7, 7, 6, 'Дефектация изделия 9А317Э собранном виде', 1, 2), -- Дефектационная ведомость, акт тех состояния, ПЗ,
    (8, 8, 6, 'Демонтаж стойки С25М1-1, модуля ФД12-3М из состава СТС 9С625М1 изделия 9А317Э', 1, 2), -- ПЗ, Руководство
    (9, 8, 6, 'Демонтаж НЕИСПРАВНОГО блока питания ФД10-71', 1, 2), -- ПЗ, Руководство
    (10, 23, 7, 'Работа по составной части неисправного блока питания ФД10-71', 1, 3), --ПЗ, Руководство
        (11, 10, 7, 'Передача БП ФД10-71 в стационарный КРДО «РЕДИКОМ»',  10, 4), -- Акт приёма передачи
        (12, 10, 7, 'Прием и учет блока питания ФД10-71', 10, 4),
        (13, 10, 7, 'Идентификация блока питания ФД10-71', 10, 4),
        (14, 10, 7, 'Подготовка производственного задания на ремонт', 10, 4), -- Тут открывается дело ремонта
        (15, 10, 7, 'Постановка задачи начальнику СКДА-3', 10, 4),
        (16, 10, 8, 'Приём/передача блока питания ФД10-71 на СКДА-3 для ремонта', 10, 4),
        (17, 11, 9, 'Внешний осмотр (дефектация), БП ФД10-71 на ТРМ3-1', 10, 4),
        (18, 12, 9, 'Очистка БП ФД10-71 и краевых разъемов на ТРМ3- 1', 10, 4),
        (19, 3, 9, 'Имеются дефекты после внешнего осмотра БП ФД10-71 на ТРМ3-1?', 10, 4), -- техническая задача-условие
            (20, 13, 9, 'Устранение механических повреждений БП ФД10-71 на ТРМ3-1',  10, 4), -- Если Да
            (21, 11, 9, 'Внешний осмотр БП ФД10-71 на ТРМ3-1', 10, 4),

        -- \/ \/ цикл, пока не 'Восстановят составные части'
        (22, 14, 8, 'Диагностика блока питания ФД10-71 на АРМ СКДА', 10, 4), -- Если нет, начало цикла
        (23, 3, 8, 'Блок питания ФД10-71 ИСПРАВЕН?',  10, 4), -- техническое задача-условие
            -- Если нет
            (24, 15, 8, 'Настройка блок питания ФД10-71 на АРМ СКДА', 10, 4), -- Если нет
            (25, 3, 8, 'Блок питания ФД10-71 НАСТРОЕН?', 10, 4), -- техническое задача-условие, если да, возврат в цикл к 22 задаче
                (26, 15, 8, 'Поиск неисправности блока питания ФД10-71 на АРМ СКДА-3', 10, 4), -- Если нет
                (27, 3, 8, 'Неисправность БП ФД10-71 ЛОКАЛИЗОВАНА?', 10, 4), -- техническое задача-условие
                    (28, 16, 10, 'Запрос в АСУ ТГ о наличии ЗИП-Р для ремонта БП ФД10-71', 10, 4),
                    (29, 16, 11, 'Поиск ЭРЭ в комплектах ЗИП-Р СРЦ, (КРДО «Редиком»)', 10, 4),
                    (30, 16, 11, 'Выдача (получение) ЭРЭ из комплекта ЗИП-Р для ремонта БП ФД10-71', 10, 4),
                    (31, 16, 12, 'Замена неисправных ЭРЭ ТРМ-2', 10, 4), -- Возврат в цикл, к 22 задаче

        -- Если да
        (32, 3, 12, 'Требуется восстановление ЛКП БП ФД10-71?', 10, 4), -- Если да, техническое задача-условие
            (33, 15, 13, 'Восстановление ЛКП блока питания ФД10-71 на ТРМ3-2', 10, 4),
            (34,  3, 13, 'Требуется восстановление маркировки и/или крепежа ЭРЭ блока питания ФД10-71?', 10, 4), -- техническое задача-условие, null),
                (35, 15, 9, 'Восстановление маркировки и/или крепежа ЭРЭ блока питания ФД10-71 на ТРМ3-1', 10, 4), -- Если да
            (36, 11, 9, 'Внешний осмотр БПФД10-71 на ТРМ3-1', 10, 4), -- Если нет, возврат в цикл к 22 задаче
        -- /\ /\ цикл

        (37, 17, 8, 'Прием/передача БП ФД10-71 из СКДА-3 на склад ЗИП и МС', 10, 4),
        (38, 17, 10, 'Учёт работы СКДА-3 в АРМ начальника КРДО', 10, 4),
        (39, 17, 10, 'Учёт использованных ЗИП и материалов в АРМ начальника КРДО', 10, 4),
        (40, 17, 14, 'КОНТРОЛЬ КАЧЕСТВА ремонта блока питания ФД10-71', 10, 4),
        (41, 18, 15, 'Передача БП ФД10-71 на участок комплектации изделия 9А317Э', 10, 4),
    (42, 18, 16, 'Передача БП ФД10-71 на участок общей сборки изделия 9А317Э', 1, 2),
    (43, 18, 16, 'Общая сборка изделия 9А317Э', 1, 2),
    (44, 18, 16, 'Монтаж/сборка стойки С25М1-1 на изделие 9А317Э', 1, 2),
    (45, 18, 16, 'Монтаж/сборка блока питания ФД10-71', 1, 2),
    (46, 18, 16, 'Предварительная настройка и регулировка параметров изделия 9А317Э', 1, 2),
    (47, 19, 16, 'Стационарные испытания изделия 9А317Э (шасси ГМ-569Б-01)', 1, 2),
    (48, 19, 17, 'Антенные измерения, настройка параметров изделия 9А317Э', 1, 2),
    (49, 19, 17, 'Пробеговые испытания изделия 9А317Э (шасси ГМ-569Б-01)', 1, 2),
    (50, 19, 17, 'Комплексная настройка и регулировка параметров изделия 9А317Э', 1, 2),
    (51, 20, 18, 'Покраска изделия 9А317Э в подразделениях СРЦ', 1, 2),
    (52, 21, 19, 'Передача/прием изделия 9А317Э между подразделениями СРЦ', 1, 2),
    (53, 21, 20, 'КОНТРОЛЬ КАЧЕСТВА ремонта изделия 9А317Э в целом', 1, 2),
    (54, 22, 2, 'Подготовка сопроводительной документации на изделие 9А317Э', 1, 2),
    (55, 22, 21, 'Передача изделия 9А317Э Заказчику', 1, 2);
select setval(pg_get_serial_sequence('task.template_task','id'), 55);

INSERT INTO task.template_task_previous_next (previous_link, next_link, choice_neg_task_link) VALUES
(2,3, null), (3,4, null),(4,5,null),
(5,6,null), (6,7,null), (7,8,null), (8,9, null),
(9,10, null), (11,12,null), (12,13,null),
(13,14, null), (14,15,null), (15,16,null), (16,17, null),
(17,18,null), (18,19, null), (19,20,22), (20,21,null),
(21,19, null), (22,23, null), (23,32,24),
(24,25,null), (25,22, 26), (26,27,null), (27,28, 26),
(28,29,null), (29,30,null), (30,31,null), (31,22, null),
(32,33,37), (33, 34, null), (34,35,36), (36,22, null),
(37,38,null), (38,39,null), (39,40,null),(40,41,null),
(10,42,null), (42,43,null), (43,44,null), (44,45,null),
(45,46,null), (46,47,null), (47,48,null), (48,49,null),
(49,50,null), (50,51,null), (51,52,null), (52,53,null),
(53,54,null), (54,55,null), (35,36,null);

INSERT INTO task.template_task_tool
(id, task_link, tool_link) VALUES
(1, 5, 1),
(2, 5, 2),
(3, 8, 3),
(4, 8, 4),
(5, 22, 5),
(6, 22, 6),
(7, 31, 7);
select setval(pg_get_serial_sequence('task.template_task_tool','id'), 7);

INSERT INTO task.template_task_zip
(id, task_link, zip_link, kol_pln, increase, decrease) VALUES
(1, 31, 8, 1, 10,2),  -- Микросхема
(2, 31, 9, 10, 10,8); -- Блок какой-то
select setval(pg_get_serial_sequence('task.template_task_zip','id'), 2);

INSERT INTO task.Template_Task_Article_Work
(id, task_link, object_link) VALUES
(1, 1, 1);  -- Грузовой автомобиль КамАЗ-43118
select setval(pg_get_serial_sequence('task.Template_Task_Article_Work','id'), 1);